Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/mem2mem.h
/*
 * Component description for MEM2MEM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_MEM2MEM_COMPONENT_H_
#define _PIC32CXMTSH_MEM2MEM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MEM2MEM                                      */
/* ************************************************************************** */

/* -------- MEM2MEM_THR : (MEM2MEM Offset: 0x00) (R/W 32) Transfer Holding Register -------- */
#define MEM2MEM_THR_THDATA_Pos                _UINT32_(0)                                          /* (MEM2MEM_THR) Transfer Holding Data Position */
#define MEM2MEM_THR_THDATA_Msk                (_UINT32_(0xFFFFFFFF) << MEM2MEM_THR_THDATA_Pos)     /* (MEM2MEM_THR) Transfer Holding Data Mask */
#define MEM2MEM_THR_THDATA(value)             (MEM2MEM_THR_THDATA_Msk & (_UINT32_(value) << MEM2MEM_THR_THDATA_Pos)) /* Assigment of value for THDATA in the MEM2MEM_THR register */
#define MEM2MEM_THR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_THR) Register Mask  */


/* -------- MEM2MEM_MR : (MEM2MEM Offset: 0x04) (R/W 32) Mode Register -------- */
#define MEM2MEM_MR_TSIZE_Pos                  _UINT32_(0)                                          /* (MEM2MEM_MR) Transfer Size Position */
#define MEM2MEM_MR_TSIZE_Msk                  (_UINT32_(0x3) << MEM2MEM_MR_TSIZE_Pos)              /* (MEM2MEM_MR) Transfer Size Mask */
#define MEM2MEM_MR_TSIZE(value)               (MEM2MEM_MR_TSIZE_Msk & (_UINT32_(value) << MEM2MEM_MR_TSIZE_Pos)) /* Assigment of value for TSIZE in the MEM2MEM_MR register */
#define   MEM2MEM_MR_TSIZE_T_8BIT_Val         _UINT32_(0x0)                                        /* (MEM2MEM_MR) The buffer size is defined in bytes.  */
#define   MEM2MEM_MR_TSIZE_T_16BIT_Val        _UINT32_(0x1)                                        /* (MEM2MEM_MR) The buffer size is defined in half-words (16-bit).  */
#define   MEM2MEM_MR_TSIZE_T_32BIT_Val        _UINT32_(0x2)                                        /* (MEM2MEM_MR) The buffer size is defined in words (32-bit). Default value.  */
#define MEM2MEM_MR_TSIZE_T_8BIT               (MEM2MEM_MR_TSIZE_T_8BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in bytes. Position  */
#define MEM2MEM_MR_TSIZE_T_16BIT              (MEM2MEM_MR_TSIZE_T_16BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in half-words (16-bit). Position  */
#define MEM2MEM_MR_TSIZE_T_32BIT              (MEM2MEM_MR_TSIZE_T_32BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in words (32-bit). Default value. Position  */
#define MEM2MEM_MR_Msk                        _UINT32_(0x00000003)                                 /* (MEM2MEM_MR) Register Mask  */


/* -------- MEM2MEM_IER : (MEM2MEM Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define MEM2MEM_IER_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_IER) End of Transfer Interrupt Enable Position */
#define MEM2MEM_IER_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_IER_RXEND_Pos)             /* (MEM2MEM_IER) End of Transfer Interrupt Enable Mask */
#define MEM2MEM_IER_RXEND(value)              (MEM2MEM_IER_RXEND_Msk & (_UINT32_(value) << MEM2MEM_IER_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_IER register */
#define MEM2MEM_IER_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_IER) Buffer Full Interrupt Enable Position */
#define MEM2MEM_IER_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_IER_RXBUFF_Pos)            /* (MEM2MEM_IER) Buffer Full Interrupt Enable Mask */
#define MEM2MEM_IER_RXBUFF(value)             (MEM2MEM_IER_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_IER register */
#define MEM2MEM_IER_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_IER) Register Mask  */


/* -------- MEM2MEM_IDR : (MEM2MEM Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define MEM2MEM_IDR_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_IDR) End of Transfer Interrupt Disable Position */
#define MEM2MEM_IDR_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_IDR_RXEND_Pos)             /* (MEM2MEM_IDR) End of Transfer Interrupt Disable Mask */
#define MEM2MEM_IDR_RXEND(value)              (MEM2MEM_IDR_RXEND_Msk & (_UINT32_(value) << MEM2MEM_IDR_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_IDR register */
#define MEM2MEM_IDR_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_IDR) Buffer Full Interrupt Disable Position */
#define MEM2MEM_IDR_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_IDR_RXBUFF_Pos)            /* (MEM2MEM_IDR) Buffer Full Interrupt Disable Mask */
#define MEM2MEM_IDR_RXBUFF(value)             (MEM2MEM_IDR_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_IDR register */
#define MEM2MEM_IDR_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_IDR) Register Mask  */


/* -------- MEM2MEM_IMR : (MEM2MEM Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define MEM2MEM_IMR_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_IMR) End of Transfer Interrupt Mask Position */
#define MEM2MEM_IMR_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_IMR_RXEND_Pos)             /* (MEM2MEM_IMR) End of Transfer Interrupt Mask Mask */
#define MEM2MEM_IMR_RXEND(value)              (MEM2MEM_IMR_RXEND_Msk & (_UINT32_(value) << MEM2MEM_IMR_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_IMR register */
#define MEM2MEM_IMR_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_IMR) Buffer Full Interrupt Mask Position */
#define MEM2MEM_IMR_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_IMR_RXBUFF_Pos)            /* (MEM2MEM_IMR) Buffer Full Interrupt Mask Mask */
#define MEM2MEM_IMR_RXBUFF(value)             (MEM2MEM_IMR_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_IMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_IMR register */
#define MEM2MEM_IMR_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_IMR) Register Mask  */


/* -------- MEM2MEM_ISR : (MEM2MEM Offset: 0x14) ( R/ 32) Interrupt Status Register -------- */
#define MEM2MEM_ISR_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_ISR) End of Transfer Position */
#define MEM2MEM_ISR_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_ISR_RXEND_Pos)             /* (MEM2MEM_ISR) End of Transfer Mask */
#define MEM2MEM_ISR_RXEND(value)              (MEM2MEM_ISR_RXEND_Msk & (_UINT32_(value) << MEM2MEM_ISR_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_ISR register */
#define MEM2MEM_ISR_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_ISR) Buffer Full Position */
#define MEM2MEM_ISR_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_ISR_RXBUFF_Pos)            /* (MEM2MEM_ISR) Buffer Full Mask */
#define MEM2MEM_ISR_RXBUFF(value)             (MEM2MEM_ISR_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_ISR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_ISR register */
#define MEM2MEM_ISR_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_ISR) Register Mask  */


/* -------- MEM2MEM_WPMR : (MEM2MEM Offset: 0x18) (R/W 32) Write Protection Mode Register -------- */
#define MEM2MEM_WPMR_WPEN_Pos                 _UINT32_(0)                                          /* (MEM2MEM_WPMR) Write Protection Configuration Enable Position */
#define MEM2MEM_WPMR_WPEN_Msk                 (_UINT32_(0x1) << MEM2MEM_WPMR_WPEN_Pos)             /* (MEM2MEM_WPMR) Write Protection Configuration Enable Mask */
#define MEM2MEM_WPMR_WPEN(value)              (MEM2MEM_WPMR_WPEN_Msk & (_UINT32_(value) << MEM2MEM_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the MEM2MEM_WPMR register */
#define MEM2MEM_WPMR_WPITEN_Pos               _UINT32_(1)                                          /* (MEM2MEM_WPMR) Write Protection Interruption Enable Position */
#define MEM2MEM_WPMR_WPITEN_Msk               (_UINT32_(0x1) << MEM2MEM_WPMR_WPITEN_Pos)           /* (MEM2MEM_WPMR) Write Protection Interruption Enable Mask */
#define MEM2MEM_WPMR_WPITEN(value)            (MEM2MEM_WPMR_WPITEN_Msk & (_UINT32_(value) << MEM2MEM_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the MEM2MEM_WPMR register */
#define MEM2MEM_WPMR_WPKEY_Pos                _UINT32_(8)                                          /* (MEM2MEM_WPMR) Write Protection Key Position */
#define MEM2MEM_WPMR_WPKEY_Msk                (_UINT32_(0xFFFFFF) << MEM2MEM_WPMR_WPKEY_Pos)       /* (MEM2MEM_WPMR) Write Protection Key Mask */
#define MEM2MEM_WPMR_WPKEY(value)             (MEM2MEM_WPMR_WPKEY_Msk & (_UINT32_(value) << MEM2MEM_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the MEM2MEM_WPMR register */
#define   MEM2MEM_WPMR_WPKEY_PASSWD_Val       _UINT32_(0x4D454D)                                   /* (MEM2MEM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN bits. Always reads as 0.  */
#define MEM2MEM_WPMR_WPKEY_PASSWD             (MEM2MEM_WPMR_WPKEY_PASSWD_Val << MEM2MEM_WPMR_WPKEY_Pos) /* (MEM2MEM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN bits. Always reads as 0. Position  */
#define MEM2MEM_WPMR_Msk                      _UINT32_(0xFFFFFF03)                                 /* (MEM2MEM_WPMR) Register Mask  */


/* -------- MEM2MEM_RPR : (MEM2MEM Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define MEM2MEM_RPR_RXPTR_Pos                 _UINT32_(0)                                          /* (MEM2MEM_RPR) Receive Pointer Register Position */
#define MEM2MEM_RPR_RXPTR_Msk                 (_UINT32_(0xFFFFFFFF) << MEM2MEM_RPR_RXPTR_Pos)      /* (MEM2MEM_RPR) Receive Pointer Register Mask */
#define MEM2MEM_RPR_RXPTR(value)              (MEM2MEM_RPR_RXPTR_Msk & (_UINT32_(value) << MEM2MEM_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the MEM2MEM_RPR register */
#define MEM2MEM_RPR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_RPR) Register Mask  */


/* -------- MEM2MEM_RCR : (MEM2MEM Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define MEM2MEM_RCR_RXCTR_Pos                 _UINT32_(0)                                          /* (MEM2MEM_RCR) Receive Counter Register Position */
#define MEM2MEM_RCR_RXCTR_Msk                 (_UINT32_(0xFFFF) << MEM2MEM_RCR_RXCTR_Pos)          /* (MEM2MEM_RCR) Receive Counter Register Mask */
#define MEM2MEM_RCR_RXCTR(value)              (MEM2MEM_RCR_RXCTR_Msk & (_UINT32_(value) << MEM2MEM_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the MEM2MEM_RCR register */
#define MEM2MEM_RCR_Msk                       _UINT32_(0x0000FFFF)                                 /* (MEM2MEM_RCR) Register Mask  */


/* -------- MEM2MEM_TPR : (MEM2MEM Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define MEM2MEM_TPR_TXPTR_Pos                 _UINT32_(0)                                          /* (MEM2MEM_TPR) Transmit Counter Register Position */
#define MEM2MEM_TPR_TXPTR_Msk                 (_UINT32_(0xFFFFFFFF) << MEM2MEM_TPR_TXPTR_Pos)      /* (MEM2MEM_TPR) Transmit Counter Register Mask */
#define MEM2MEM_TPR_TXPTR(value)              (MEM2MEM_TPR_TXPTR_Msk & (_UINT32_(value) << MEM2MEM_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the MEM2MEM_TPR register */
#define MEM2MEM_TPR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_TPR) Register Mask  */


