Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/mem2mem.h
/* -------- MEM2MEM_TCR : (MEM2MEM Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define MEM2MEM_TCR_TXCTR_Pos                 _UINT32_(0)                                          /* (MEM2MEM_TCR) Transmit Counter Register Position */
#define MEM2MEM_TCR_TXCTR_Msk                 (_UINT32_(0xFFFF) << MEM2MEM_TCR_TXCTR_Pos)          /* (MEM2MEM_TCR) Transmit Counter Register Mask */
#define MEM2MEM_TCR_TXCTR(value)              (MEM2MEM_TCR_TXCTR_Msk & (_UINT32_(value) << MEM2MEM_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the MEM2MEM_TCR register */
#define MEM2MEM_TCR_Msk                       _UINT32_(0x0000FFFF)                                 /* (MEM2MEM_TCR) Register Mask  */


/* -------- MEM2MEM_RNPR : (MEM2MEM Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define MEM2MEM_RNPR_RXNPTR_Pos               _UINT32_(0)                                          /* (MEM2MEM_RNPR) Receive Next Pointer Position */
#define MEM2MEM_RNPR_RXNPTR_Msk               (_UINT32_(0xFFFFFFFF) << MEM2MEM_RNPR_RXNPTR_Pos)    /* (MEM2MEM_RNPR) Receive Next Pointer Mask */
#define MEM2MEM_RNPR_RXNPTR(value)            (MEM2MEM_RNPR_RXNPTR_Msk & (_UINT32_(value) << MEM2MEM_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the MEM2MEM_RNPR register */
#define MEM2MEM_RNPR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_RNPR) Register Mask  */


/* -------- MEM2MEM_RNCR : (MEM2MEM Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define MEM2MEM_RNCR_RXNCTR_Pos               _UINT32_(0)                                          /* (MEM2MEM_RNCR) Receive Next Counter Position */
#define MEM2MEM_RNCR_RXNCTR_Msk               (_UINT32_(0xFFFF) << MEM2MEM_RNCR_RXNCTR_Pos)        /* (MEM2MEM_RNCR) Receive Next Counter Mask */
#define MEM2MEM_RNCR_RXNCTR(value)            (MEM2MEM_RNCR_RXNCTR_Msk & (_UINT32_(value) << MEM2MEM_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the MEM2MEM_RNCR register */
#define MEM2MEM_RNCR_Msk                      _UINT32_(0x0000FFFF)                                 /* (MEM2MEM_RNCR) Register Mask  */


/* -------- MEM2MEM_TNPR : (MEM2MEM Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define MEM2MEM_TNPR_TXNPTR_Pos               _UINT32_(0)                                          /* (MEM2MEM_TNPR) Transmit Next Pointer Position */
#define MEM2MEM_TNPR_TXNPTR_Msk               (_UINT32_(0xFFFFFFFF) << MEM2MEM_TNPR_TXNPTR_Pos)    /* (MEM2MEM_TNPR) Transmit Next Pointer Mask */
#define MEM2MEM_TNPR_TXNPTR(value)            (MEM2MEM_TNPR_TXNPTR_Msk & (_UINT32_(value) << MEM2MEM_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the MEM2MEM_TNPR register */
#define MEM2MEM_TNPR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_TNPR) Register Mask  */


/* -------- MEM2MEM_TNCR : (MEM2MEM Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define MEM2MEM_TNCR_TXNCTR_Pos               _UINT32_(0)                                          /* (MEM2MEM_TNCR) Transmit Counter Next Position */
#define MEM2MEM_TNCR_TXNCTR_Msk               (_UINT32_(0xFFFF) << MEM2MEM_TNCR_TXNCTR_Pos)        /* (MEM2MEM_TNCR) Transmit Counter Next Mask */
#define MEM2MEM_TNCR_TXNCTR(value)            (MEM2MEM_TNCR_TXNCTR_Msk & (_UINT32_(value) << MEM2MEM_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the MEM2MEM_TNCR register */
#define MEM2MEM_TNCR_Msk                      _UINT32_(0x0000FFFF)                                 /* (MEM2MEM_TNCR) Register Mask  */


/* -------- MEM2MEM_PTCR : (MEM2MEM Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define MEM2MEM_PTCR_RXTEN_Pos                _UINT32_(0)                                          /* (MEM2MEM_PTCR) Receiver Transfer Enable Position */
#define MEM2MEM_PTCR_RXTEN_Msk                (_UINT32_(0x1) << MEM2MEM_PTCR_RXTEN_Pos)            /* (MEM2MEM_PTCR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTCR_RXTEN(value)             (MEM2MEM_PTCR_RXTEN_Msk & (_UINT32_(value) << MEM2MEM_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_RXTDIS_Pos               _UINT32_(1)                                          /* (MEM2MEM_PTCR) Receiver Transfer Disable Position */
#define MEM2MEM_PTCR_RXTDIS_Msk               (_UINT32_(0x1) << MEM2MEM_PTCR_RXTDIS_Pos)           /* (MEM2MEM_PTCR) Receiver Transfer Disable Mask */
#define MEM2MEM_PTCR_RXTDIS(value)            (MEM2MEM_PTCR_RXTDIS_Msk & (_UINT32_(value) << MEM2MEM_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_TXTEN_Pos                _UINT32_(8)                                          /* (MEM2MEM_PTCR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTCR_TXTEN_Msk                (_UINT32_(0x1) << MEM2MEM_PTCR_TXTEN_Pos)            /* (MEM2MEM_PTCR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTCR_TXTEN(value)             (MEM2MEM_PTCR_TXTEN_Msk & (_UINT32_(value) << MEM2MEM_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_TXTDIS_Pos               _UINT32_(9)                                          /* (MEM2MEM_PTCR) Transmitter Transfer Disable Position */
#define MEM2MEM_PTCR_TXTDIS_Msk               (_UINT32_(0x1) << MEM2MEM_PTCR_TXTDIS_Pos)           /* (MEM2MEM_PTCR) Transmitter Transfer Disable Mask */
#define MEM2MEM_PTCR_TXTDIS(value)            (MEM2MEM_PTCR_TXTDIS_Msk & (_UINT32_(value) << MEM2MEM_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_RXCBEN_Pos               _UINT32_(16)                                         /* (MEM2MEM_PTCR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTCR_RXCBEN_Msk               (_UINT32_(0x1) << MEM2MEM_PTCR_RXCBEN_Pos)           /* (MEM2MEM_PTCR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_RXCBEN(value)            (MEM2MEM_PTCR_RXCBEN_Msk & (_UINT32_(value) << MEM2MEM_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_RXCBDIS_Pos              _UINT32_(17)                                         /* (MEM2MEM_PTCR) Receiver Circular Buffer Disable Position */
#define MEM2MEM_PTCR_RXCBDIS_Msk              (_UINT32_(0x1) << MEM2MEM_PTCR_RXCBDIS_Pos)          /* (MEM2MEM_PTCR) Receiver Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_RXCBDIS(value)           (MEM2MEM_PTCR_RXCBDIS_Msk & (_UINT32_(value) << MEM2MEM_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_TXCBEN_Pos               _UINT32_(18)                                         /* (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTCR_TXCBEN_Msk               (_UINT32_(0x1) << MEM2MEM_PTCR_TXCBEN_Pos)           /* (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_TXCBEN(value)            (MEM2MEM_PTCR_TXCBEN_Msk & (_UINT32_(value) << MEM2MEM_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_TXCBDIS_Pos              _UINT32_(19)                                         /* (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Position */
#define MEM2MEM_PTCR_TXCBDIS_Msk              (_UINT32_(0x1) << MEM2MEM_PTCR_TXCBDIS_Pos)          /* (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_TXCBDIS(value)           (MEM2MEM_PTCR_TXCBDIS_Msk & (_UINT32_(value) << MEM2MEM_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_ERRCLR_Pos               _UINT32_(24)                                         /* (MEM2MEM_PTCR) Transfer Bus Error Clear Position */
#define MEM2MEM_PTCR_ERRCLR_Msk               (_UINT32_(0x1) << MEM2MEM_PTCR_ERRCLR_Pos)           /* (MEM2MEM_PTCR) Transfer Bus Error Clear Mask */
#define MEM2MEM_PTCR_ERRCLR(value)            (MEM2MEM_PTCR_ERRCLR_Msk & (_UINT32_(value) << MEM2MEM_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the MEM2MEM_PTCR register */
#define MEM2MEM_PTCR_Msk                      _UINT32_(0x010F0303)                                 /* (MEM2MEM_PTCR) Register Mask  */


